/*
 * allmess.ino
 * https://litl-admin.ru/zhelezo/podklyuchaem-gps-modul-vk16e-k-arduino.html
 * Получаем поток данных, который нужно распарсить. Для этого обратимся к документации NMEA-протокола.
 * https://aprs.gids.nl/nmea/

Возьмём строчку:
$GPGGA, 023554.000,4657.9000,N,14243.1000,E,1,05,2.3,89.3,M,25.2,M,,0000*6C

Сообщение GPGGA – это информация о фиксированном решении (есть ещё GPGSV – информация о спутниках) и т.д.
Первый параметр – точное время: 023554.000 – это 02:35:54 UTC, прибавляем 10 часов и получаем 12:35:54 локальное время. 
Прибавку к времени легко узнать по часовому поясу.

Второй и третий параметры – широта и долгота:
4657.9000 = 46°57.9000 N
14343.1000 = 143°43.1000 E

Прям эти координаты вставляем последовательно в гугл-карты или яндекс.карты и увидим местоположение с точностью до дома!

Далее тип решения, 1 – StandAlone – самостоятельный.
05 – количество спутников.
2.3 – относительная горизонтальная точность.
89.3,М – высота над уровнем моря.  Далее высота от эллипсойда WGS84

Последний параметр – контрольная сумма

Все сообщения у окна 17.05.2026:

$GPGSV,4,1,13,01,61,199,19,02,35,173,28,03,59,264,09,04,13,217,24*78
$GPGSV,4,2,13,06,01,318,,12,12,020,,13,14,022,,17,32,287,*7F
$GPGSV,4,3,13,19,24,321,11,25,07,056,18,28,38,105,28,31,23,136,28*7A
$GPGSV,4,4,13,32,36,064,16*4A
$GPGLL,6148.11477,N,03419.79022,E,143322.00,A,A*62
$GPRMC,143323.00,A,6148.11498,N,03419.79004,E,0.241,,170526,,,A*7F
$GPVTG,,T,,M,0.241,N,0.446,K,A*22
$GPGGA,143323.00,6148.11498,N,03419.79004,E,1,05,1.97,73.0,M,14.2,M,,*6A
$GPGSA,A,3,02,28,32,04,31,,,,,,,,4.94,1.97,4.53*09

$GPGSV,4,1,13,01,61,199,18,02,35,173,28,03,59,264,09,04,13,217,23*7E
$GPGSV,4,2,13,06,01,318,,12,12,020,,13,14,022,,17,32,287,*7F
$GPGSV,4,3,13,19,24,321,11,25,07,056,18,28,38,105,28,31,23,136,29*7B
$GPGSV,4,4,13,32,36,064,15*49
$GPGLL,6148.11498,N,03419.79004,E,143323.00,A,A*66
$GPRMC,143324.00,A,6148.11509,N,03419.78991,E,0.226,,170526,,,A*74
$GPVTG,,T,,M,0.226,N,0.418,K,A*28
$GPGGA,143324.00,6148.11509,N,03419.78991,E,1,05,1.97,73.0,M,14.2,M,,*60
$GPGSA,A,3,02,28,32,04,31,,,,,,,,4.94,1.97,4.53*09

*/


#include <SoftwareSerial.h>
SoftwareSerial GPS(2, 3);
unsigned char buffer[64]; // buffer
int count=0;
void setup()
{
    GPS.begin(9600);
    Serial.begin(9600);
}

void loop()
{
    if (GPS.available())
    {
        while(GPS.available())
        {
            buffer[count++]=GPS.read();
            if(count == 64)
            break;
        }
        Serial.write(buffer,count);
        clrBuff();
        count = 0;
    }
}

void clrBuff()
{
    for (int i=0; i<count;i++)
    {
        buffer[i]=NULL;
    }
}
